Adding to my comment above:

I've managed to refactor my terraform code switching from the Telmate Proxmox provider to bpg, which mostly works well.

But importing existing VMs yields a similar "forces replacement" error for existing disks:

Terraform will perform the following actions:

```
  # module.proxmox_monero-j[0].proxmox_virtual_environment_vm.vm must be replaced
-/+ resource "proxmox_virtual_environment_vm" "vm" {
      ~ id                      = "101" -> (known after apply)
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
            ],
          - [
              - "10.10.4.10",
            ],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [
              - "fe80::38f0:f8ff:fe56:b90b",
            ],
        ] -> (known after apply)
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
          - "3A:F0:F8:56:B9:0B",
        ] -> (known after apply)
        name                    = "monero-j01"
      ~ network_interface_names = [
          - "lo",
          - "eth0",
        ] -> (known after apply)
      - tags                    = [] -> null
      + vm_id                   = (known after apply)
        # (21 unchanged attributes hidden)

      + clone {
          + datastore_id = "vmpool_zfs_encrypted"
          + full         = true
          + node_name    = "atlas"
          + retries      = 1
          + vm_id        = 126
        }

      ~ cpu {
          - flags        = [] -> null
            # (7 unchanged attributes hidden)
        }

      + disk { # forces replacement
          + cache             = "writeback"
          + datastore_id      = "vmpool_zfs_encrypted"
          + discard           = "on"
          + file_format       = "raw" # forces replacement
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + size              = 40
          + ssd               = true
        }
      + disk { # forces replacement
          + cache             = "writeback"
          + datastore_id      = "vmpool_zfs_encrypted"
          + discard           = "on"
          + file_format       = "raw" # forces replacement
          + interface         = "scsi1"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + size              = 250
          + ssd               = true
        }

      ~ initialization {
          - interface    = "ide0" -> null
            # (1 unchanged attribute hidden)

            # (2 unchanged blocks hidden)
        }

      ~ network_device {
          ~ mac_address = "3A:F0:F8:56:B9:0B" -> (known after apply)
            # (8 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```
The `file_format` variable seems to have a problem. It does not matter if the value is explicitly set to `raw` or if `file_format` is omitted entirely. The only way to mitigate at the moment is to ignore the disk resource globally, which leaves a clean state after `terraform apply`.

```
  lifecycle {
    ignore_changes = [
      clone,
      disk,
    ]
  }
```


Proxmox 8.0.4
Terraform 1.6.3
bpg/proxmox 0.38.1